src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>EnumRef.ВидыЦенПродажи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыЦенПродажи/ВидыЦенПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенПродажи</name>
  <enumValues>
    <name>Розничная</name>
  </enumValues>
  <enumValues>
    <name>Дисконт</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/РаботаСЦенами/Module.bsl
// Общий модуль "РаботаСЦенами"
// Содержит функции для получения цен номенклатуры из регистра сведений "ЦеныНоменклатуры".

#Область ПрограммныйИнтерфейс

// Возвращает актуальную цену продажи для заданной номенклатуры на указанную дату.
// Использует виртуальную таблицу "СрезПоследних", которая возвращает последнюю по времени запись
// на заданный момент (не позже переданной даты).
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - элемент номенклатуры.
//   ВидЦены      - ПеречислениеСсылка.ВидыЦенПродажи - если не задан,
//                  используется "Розничная" (необязательный).
//   ДатаЦены     - Дата - дата, на которую требуется цена. Если не задана,
//                  используется текущая дата (необязательный).
// Возвращаемое значение:
//   Число - цену из регистра сведений; 0, если запись не найдена.
Функция ПолучитьЦенуПродажиНаДату(Номенклатура, ВидЦены = Неопределено, ДатаЦены = Неопределено) Экспорт
    // Если вид цены не передан, подставляем значение по умолчанию – розничная цена.
    Если ВидЦены = Неопределено Тогда
        ВидЦены = Перечисления.ВидыЦенПродажи.Розничная;
    КонецЕсли;
    // Если дата не передана, используем текущую дату сервера.
    Если ДатаЦены = Неопределено Тогда
        ДатаЦены = ТекущаяДатаСеанса();   // заменили на рекомендуемый метод
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
    |ИЗ
    |    РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
    |            &Период,
    |            Номенклатура = &Номенклатура И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Период", ДатаЦены);
    Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Цена;
    Иначе
        // Цена не установлена – возвращаем 0, чтобы избежать падения вызывающего кода.
        Возврат 0;
    КонецЕсли;
КонецФункции

// Возвращает цену, установленную строго на указанную дату (без анализа ближайшего прошлого).
// В отличие от ПолучитьЦенуПродажиНаДату, здесь фильтр по полю "Период" является точным,
// т.е. запись должна существовать именно на переданную дату.
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура.
//   ВидЦены      - ПеречислениеСсылка.ВидыЦенПродажи - (обязательный).
//   ДатаЦены     - Дата - дата, на которую ищется запись (обязательный).
// Возвращаемое значение:
//   Число - цену; 0, если запись с такими параметрами не найдена.
Функция ПолучитьЦенуНаКонкретнуюДату(Номенклатура, ВидЦены, ДатаЦены) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ЦеныНоменклатуры.Цена КАК Цена
    |ИЗ
    |    РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
    |ГДЕ
    |    ЦеныНоменклатуры.Период = &Период
    |    И ЦеныНоменклатуры.Номенклатура = &Номенклатура
    |    И ЦеныНоменклатуры.ВидЦены = &ВидЦены";
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Период", ДатаЦены);
    Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Цена;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

#КонецОбласти
